Reports/ЗарплатыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>ЗарплатыСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Зарплата</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипВзаиморасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаиморасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ЗарплатыСотрудников/Ext/ObjectModule.bsl
Процедура Сформировать(ТабДок) Экспорт
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Основной");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьСотрудник = Макет.ПолучитьОбласть("Сотрудник");
	ОбластьРегистратор = Макет.ПолучитьОбласть("Регистратор");
	ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
	
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РегЗарплатаОстаткиИОбороты.Сотрудник КАК Сотрудник,
	|	РегЗарплатаОстаткиИОбороты.Регистратор КАК Регистратор,
	|	РегЗарплатаОстаткиИОбороты.Примечание КАК Примечание,
	|	СУММА(РегЗарплатаОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(РегЗарплатаОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	|	СУММА(РегЗарплатаОстаткиИОбороты.СуммаРасход) КАК СуммаРасход,
	|	СУММА(РегЗарплатаОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.Зарплата.ОстаткиИОбороты(&Дата1, &Дата2, Регистратор, ДвиженияИГраницыПериода) КАК РегЗарплатаОстаткиИОбороты
	|ГДЕ
	|	ИСТИНА");
	
	Если НЕ Сотрудник.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И РегЗарплатаОстаткиИОбороты.Сотрудник = &Сотрудник";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	РегЗарплатаОстаткиИОбороты.Сотрудник,
	|	РегЗарплатаОстаткиИОбороты.Регистратор,
	|	РегЗарплатаОстаткиИОбороты.Примечание
	|УПОРЯДОЧИТЬ ПО
	|	РегЗарплатаОстаткиИОбороты.Сотрудник.Наименование,
	|	РегЗарплатаОстаткиИОбороты.Регистратор.Дата
	|ИТОГИ
	|	СУММА(СуммаНачальныйОстаток),
	|	СУММА(СуммаПриход),
	|	СУММА(СуммаРасход),
	|	СУММА(СуммаКонечныйОстаток)
	|ПО
	|	ОБЩИЕ,
	|	РегЗарплатаОстаткиИОбороты.Сотрудник,
	|	Регистратор
	|	Примечание";

	Запрос.УстановитьПараметр("Дата1", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	РезультатЗапроса = Запрос.Выполнить();

	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбщийИтог.Следующий() Цикл
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());

		ВыборкаСотрудник = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСотрудник.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаСотрудник.СуммаНачальныйОстаток) = Ложь И ЗначениеЗаполнено(ВыборкаСотрудник.СуммаПриход) = Ложь И ЗначениеЗаполнено(ВыборкаСотрудник.СуммаРасход) = Ложь И ЗначениеЗаполнено(ВыборкаСотрудник.СуммаКонечныйОстаток) = Ложь Тогда
				Продолжить;
			КонецЕсли;

			ОбластьСотрудник.Параметры.Заполнить(ВыборкаСотрудник);
			ТабДок.Вывести(ОбластьСотрудник, ВыборкаСотрудник.Уровень());
			
			Если Подробно Тогда
				ВыборкаРегистратор = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаРегистратор.Следующий() Цикл
					Если ВыборкаРегистратор.Регистратор <> Неопределено И ВыборкаРегистратор.Регистратор.Дата >= НачалоДня(Период.ДатаНачала) И ВыборкаРегистратор.Регистратор.Дата <= КонецДня(Период.ДатаОкончания) Тогда
						ОбластьРегистратор.Параметры.Заполнить(ВыборкаРегистратор);
						ТабДок.Вывести(ОбластьРегистратор, ВыборкаРегистратор.Уровень());
						
						ВыборкаКомментарий = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаКомментарий.Следующий() Цикл
							Если ЗначениеЗаполнено(ВыборкаКомментарий.Примечание) И (ЗначениеЗаполнено(ВыборкаКомментарий.СуммаПриход) ИЛИ ЗначениеЗаполнено(ВыборкаКомментарий.СуммаРасход)) Тогда
								ОбластьКомментарий.Параметры.Заполнить(ВыборкаКомментарий);
								ТабДок.Вывести(ОбластьКомментарий, ВыборкаКомментарий.Уровень());
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
КонецПроцедуры
